; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l8-t1-p2---int100n150-m25---int100c110---s46---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 - location
t0 - truck
p0 p1 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level3 level3)
(sum level0 level5 level5)
(sum level0 level7 level7)
(sum level0 level8 level8)
(sum level0 level12 level12)
(sum level0 level14 level14)
(sum level0 level15 level15)
(sum level0 level17 level17)
(sum level0 level25 level25)
(sum level1 level2 level3)
(sum level1 level3 level4)
(sum level1 level5 level6)
(sum level1 level7 level8)
(sum level1 level8 level9)
(sum level1 level12 level13)
(sum level1 level14 level15)
(sum level1 level15 level16)
(sum level1 level17 level18)
(sum level1 level25 level26)
(sum level2 level2 level4)
(sum level2 level3 level5)
(sum level2 level5 level7)
(sum level2 level7 level9)
(sum level2 level8 level10)
(sum level2 level12 level14)
(sum level2 level14 level16)
(sum level2 level15 level17)
(sum level2 level17 level19)
(sum level2 level25 level27)
(sum level3 level2 level5)
(sum level3 level3 level6)
(sum level3 level5 level8)
(sum level3 level7 level10)
(sum level3 level8 level11)
(sum level3 level12 level15)
(sum level3 level14 level17)
(sum level3 level15 level18)
(sum level3 level17 level20)
(sum level3 level25 level28)
(sum level4 level2 level6)
(sum level4 level3 level7)
(sum level4 level5 level9)
(sum level4 level7 level11)
(sum level4 level8 level12)
(sum level4 level12 level16)
(sum level4 level14 level18)
(sum level4 level15 level19)
(sum level4 level17 level21)
(sum level4 level25 level29)
(sum level5 level2 level7)
(sum level5 level3 level8)
(sum level5 level5 level10)
(sum level5 level7 level12)
(sum level5 level8 level13)
(sum level5 level12 level17)
(sum level5 level14 level19)
(sum level5 level15 level20)
(sum level5 level17 level22)
(sum level5 level25 level30)
(sum level6 level2 level8)
(sum level6 level3 level9)
(sum level6 level5 level11)
(sum level6 level7 level13)
(sum level6 level8 level14)
(sum level6 level12 level18)
(sum level6 level14 level20)
(sum level6 level15 level21)
(sum level6 level17 level23)
(sum level6 level25 level31)
(sum level7 level2 level9)
(sum level7 level3 level10)
(sum level7 level5 level12)
(sum level7 level7 level14)
(sum level7 level8 level15)
(sum level7 level12 level19)
(sum level7 level14 level21)
(sum level7 level15 level22)
(sum level7 level17 level24)
(sum level7 level25 level32)
(sum level8 level2 level10)
(sum level8 level3 level11)
(sum level8 level5 level13)
(sum level8 level7 level15)
(sum level8 level8 level16)
(sum level8 level12 level20)
(sum level8 level14 level22)
(sum level8 level15 level23)
(sum level8 level17 level25)
(sum level8 level25 level33)
(sum level9 level2 level11)
(sum level9 level3 level12)
(sum level9 level5 level14)
(sum level9 level7 level16)
(sum level9 level8 level17)
(sum level9 level12 level21)
(sum level9 level14 level23)
(sum level9 level15 level24)
(sum level9 level17 level26)
(sum level9 level25 level34)
(sum level10 level2 level12)
(sum level10 level3 level13)
(sum level10 level5 level15)
(sum level10 level7 level17)
(sum level10 level8 level18)
(sum level10 level12 level22)
(sum level10 level14 level24)
(sum level10 level15 level25)
(sum level10 level17 level27)
(sum level10 level25 level35)
(sum level11 level2 level13)
(sum level11 level3 level14)
(sum level11 level5 level16)
(sum level11 level7 level18)
(sum level11 level8 level19)
(sum level11 level12 level23)
(sum level11 level14 level25)
(sum level11 level15 level26)
(sum level11 level17 level28)
(sum level11 level25 level36)
(sum level12 level2 level14)
(sum level12 level3 level15)
(sum level12 level5 level17)
(sum level12 level7 level19)
(sum level12 level8 level20)
(sum level12 level12 level24)
(sum level12 level14 level26)
(sum level12 level15 level27)
(sum level12 level17 level29)
(sum level12 level25 level37)
(sum level13 level2 level15)
(sum level13 level3 level16)
(sum level13 level5 level18)
(sum level13 level7 level20)
(sum level13 level8 level21)
(sum level13 level12 level25)
(sum level13 level14 level27)
(sum level13 level15 level28)
(sum level13 level17 level30)
(sum level13 level25 level38)
(sum level14 level2 level16)
(sum level14 level3 level17)
(sum level14 level5 level19)
(sum level14 level7 level21)
(sum level14 level8 level22)
(sum level14 level12 level26)
(sum level14 level14 level28)
(sum level14 level15 level29)
(sum level14 level17 level31)
(sum level14 level25 level39)
(sum level15 level2 level17)
(sum level15 level3 level18)
(sum level15 level5 level20)
(sum level15 level7 level22)
(sum level15 level8 level23)
(sum level15 level12 level27)
(sum level15 level14 level29)
(sum level15 level15 level30)
(sum level15 level17 level32)
(sum level15 level25 level40)
(sum level16 level2 level18)
(sum level16 level3 level19)
(sum level16 level5 level21)
(sum level16 level7 level23)
(sum level16 level8 level24)
(sum level16 level12 level28)
(sum level16 level14 level30)
(sum level16 level15 level31)
(sum level16 level17 level33)
(sum level16 level25 level41)
(sum level17 level2 level19)
(sum level17 level3 level20)
(sum level17 level5 level22)
(sum level17 level7 level24)
(sum level17 level8 level25)
(sum level17 level12 level29)
(sum level17 level14 level31)
(sum level17 level15 level32)
(sum level17 level17 level34)
(sum level17 level25 level42)
(sum level18 level2 level20)
(sum level18 level3 level21)
(sum level18 level5 level23)
(sum level18 level7 level25)
(sum level18 level8 level26)
(sum level18 level12 level30)
(sum level18 level14 level32)
(sum level18 level15 level33)
(sum level18 level17 level35)
(sum level18 level25 level43)
(sum level19 level2 level21)
(sum level19 level3 level22)
(sum level19 level5 level24)
(sum level19 level7 level26)
(sum level19 level8 level27)
(sum level19 level12 level31)
(sum level19 level14 level33)
(sum level19 level15 level34)
(sum level19 level17 level36)
(sum level19 level25 level44)
(sum level20 level2 level22)
(sum level20 level3 level23)
(sum level20 level5 level25)
(sum level20 level7 level27)
(sum level20 level8 level28)
(sum level20 level12 level32)
(sum level20 level14 level34)
(sum level20 level15 level35)
(sum level20 level17 level37)
(sum level21 level2 level23)
(sum level21 level3 level24)
(sum level21 level5 level26)
(sum level21 level7 level28)
(sum level21 level8 level29)
(sum level21 level12 level33)
(sum level21 level14 level35)
(sum level21 level15 level36)
(sum level21 level17 level38)
(sum level22 level2 level24)
(sum level22 level3 level25)
(sum level22 level5 level27)
(sum level22 level7 level29)
(sum level22 level8 level30)
(sum level22 level12 level34)
(sum level22 level14 level36)
(sum level22 level15 level37)
(sum level22 level17 level39)
(sum level23 level2 level25)
(sum level23 level3 level26)
(sum level23 level5 level28)
(sum level23 level7 level30)
(sum level23 level8 level31)
(sum level23 level12 level35)
(sum level23 level14 level37)
(sum level23 level15 level38)
(sum level23 level17 level40)
(sum level24 level2 level26)
(sum level24 level3 level27)
(sum level24 level5 level29)
(sum level24 level7 level31)
(sum level24 level8 level32)
(sum level24 level12 level36)
(sum level24 level14 level38)
(sum level24 level15 level39)
(sum level24 level17 level41)
(sum level25 level2 level27)
(sum level25 level3 level28)
(sum level25 level5 level30)
(sum level25 level7 level32)
(sum level25 level8 level33)
(sum level25 level12 level37)
(sum level25 level14 level39)
(sum level25 level15 level40)
(sum level25 level17 level42)
(sum level26 level2 level28)
(sum level26 level3 level29)
(sum level26 level5 level31)
(sum level26 level7 level33)
(sum level26 level8 level34)
(sum level26 level12 level38)
(sum level26 level14 level40)
(sum level26 level15 level41)
(sum level26 level17 level43)
(sum level27 level2 level29)
(sum level27 level3 level30)
(sum level27 level5 level32)
(sum level27 level7 level34)
(sum level27 level8 level35)
(sum level27 level12 level39)
(sum level27 level14 level41)
(sum level27 level15 level42)
(sum level27 level17 level44)
(sum level28 level2 level30)
(sum level28 level3 level31)
(sum level28 level5 level33)
(sum level28 level7 level35)
(sum level28 level8 level36)
(sum level28 level12 level40)
(sum level28 level14 level42)
(sum level28 level15 level43)
(sum level29 level2 level31)
(sum level29 level3 level32)
(sum level29 level5 level34)
(sum level29 level7 level36)
(sum level29 level8 level37)
(sum level29 level12 level41)
(sum level29 level14 level43)
(sum level29 level15 level44)
(sum level30 level2 level32)
(sum level30 level3 level33)
(sum level30 level5 level35)
(sum level30 level7 level37)
(sum level30 level8 level38)
(sum level30 level12 level42)
(sum level30 level14 level44)
(sum level31 level2 level33)
(sum level31 level3 level34)
(sum level31 level5 level36)
(sum level31 level7 level38)
(sum level31 level8 level39)
(sum level31 level12 level43)
(sum level32 level2 level34)
(sum level32 level3 level35)
(sum level32 level5 level37)
(sum level32 level7 level39)
(sum level32 level8 level40)
(sum level32 level12 level44)
(sum level33 level2 level35)
(sum level33 level3 level36)
(sum level33 level5 level38)
(sum level33 level7 level40)
(sum level33 level8 level41)
(sum level34 level2 level36)
(sum level34 level3 level37)
(sum level34 level5 level39)
(sum level34 level7 level41)
(sum level34 level8 level42)
(sum level35 level2 level37)
(sum level35 level3 level38)
(sum level35 level5 level40)
(sum level35 level7 level42)
(sum level35 level8 level43)
(sum level36 level2 level38)
(sum level36 level3 level39)
(sum level36 level5 level41)
(sum level36 level7 level43)
(sum level36 level8 level44)
(sum level37 level2 level39)
(sum level37 level3 level40)
(sum level37 level5 level42)
(sum level37 level7 level44)
(sum level38 level2 level40)
(sum level38 level3 level41)
(sum level38 level5 level43)
(sum level39 level2 level41)
(sum level39 level3 level42)
(sum level39 level5 level44)
(sum level40 level2 level42)
(sum level40 level3 level43)
(sum level41 level2 level43)
(sum level41 level3 level44)
(sum level42 level2 level44)

(connected l0 l1)
(fuelcost level14 l0 l1)
(connected l0 l2)
(fuelcost level2 l0 l2)
(connected l0 l4)
(fuelcost level8 l0 l4)
(connected l0 l5)
(fuelcost level5 l0 l5)
(connected l1 l0)
(fuelcost level14 l1 l0)
(connected l1 l3)
(fuelcost level25 l1 l3)
(connected l1 l5)
(fuelcost level5 l1 l5)
(connected l2 l0)
(fuelcost level2 l2 l0)
(connected l2 l6)
(fuelcost level7 l2 l6)
(connected l3 l1)
(fuelcost level25 l3 l1)
(connected l3 l4)
(fuelcost level8 l3 l4)
(connected l3 l5)
(fuelcost level17 l3 l5)
(connected l3 l6)
(fuelcost level3 l3 l6)
(connected l4 l0)
(fuelcost level8 l4 l0)
(connected l4 l3)
(fuelcost level8 l4 l3)
(connected l4 l6)
(fuelcost level12 l4 l6)
(connected l5 l0)
(fuelcost level5 l5 l0)
(connected l5 l1)
(fuelcost level5 l5 l1)
(connected l5 l3)
(fuelcost level17 l5 l3)
(connected l5 l7)
(fuelcost level15 l5 l7)
(connected l6 l2)
(fuelcost level7 l6 l2)
(connected l6 l3)
(fuelcost level3 l6 l3)
(connected l6 l4)
(fuelcost level12 l6 l4)
(connected l7 l5)
(fuelcost level15 l7 l5)

(at t0 l7)
(fuel t0 level44)
(= (total-cost) 0)

(at p0 l3)
(at p1 l0)
)

(:goal
(and
(at p0 l4)
(at p1 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l7 l5 level29 level15 level44)
   deleted: (at t0 l7) (fuel t0 level44)
   added: (at t0 l5) (fuel t0 level29)
   goals met: 0 of 2
2. (drive t0 l5 l0 level24 level5 level29)
   deleted: (at t0 l5) (fuel t0 level29)
   added: (at t0 l0) (fuel t0 level24)
   goals met: 0 of 2
3. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 2
4. (drive t0 l0 l2 level22 level2 level24)
   deleted: (at t0 l0) (fuel t0 level24)
   added: (at t0 l2) (fuel t0 level22)
   goals met: 0 of 2
5. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 1 of 2
6. (drive t0 l2 l6 level15 level7 level22)
   deleted: (at t0 l2) (fuel t0 level22)
   added: (at t0 l6) (fuel t0 level15)
   goals met: 1 of 2
7. (drive t0 l6 l3 level12 level3 level15)
   deleted: (at t0 l6) (fuel t0 level15)
   added: (at t0 l3) (fuel t0 level12)
   goals met: 1 of 2
8. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 1 of 2
9. (drive t0 l3 l4 level4 level8 level12)
   deleted: (at t0 l3) (fuel t0 level12)
   added: (at t0 l4) (fuel t0 level4)
   goals met: 1 of 2
10. (unload p0 t0 l4)
   deleted: (in p0 t0)
   added: (at p0 l4)
   goals met: 2 of 2
